void st_game()
  {    
    arm_down_open();
    
    goto strat_;
    strat_: 
    
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_left(300, -40, 40, 86, 30);            //------>> fw_x_left(ระยะที่เดินเข้าไป, -มอเตอร์ซ้าย, มอเตอร์ขวา, องศาที่หมุน, ค่า offset); 
    fline(52,52,0.35,30,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 1  แก้ค่า  30 เมื่อเข้าไปไม่ถึงกระป๋องทำให้วัดระยะว่ามีกระป๋องหรือไม่ 
    
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        fline(0,0,0.0, 0,'n','r',30, "a4", 40);delay(100);        
        fline_2sensor(40, 40, 0.35, 66, "3:4","27", 's', 1);delay(10); 
        goto can_2;
      }
    
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);  //------------->> แก้ค่า 11 เมื่อคีบกระป๋องไม่ได้ มีการชน 
    
    arm_close_up();
    
    bline(60,60,0.35,30,'f','s',50, "a2", 1);
    bw_x_left(350, -40, 40, 90, 40);

    check_can();
    check_can_to_floor();

    //----------------------------------------->> จบกระป๋องที่ 1 

    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_right(300, 40, -40, 85, 30);
    
    fline(52,52,0.35,29,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 2 ;
    can_2 : //----------------->>  
    
     if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(60,60,0.35,20,'f','s',50, "a2", 1);
        bw_x_left(300, -40, 40, 88, 40);
        goto can_3;
      }
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,30,'f','s',50, "a2", 1);
    bw_x_right(350, 40, -40, 90, 40);

    check_can();
    check_can_to_floor();
   ///----------------------------------------->> จบกระป๋องที่ 2

   

    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    can_3: //------------------------------------------>>>
    fline(60,60,0.35,15,'c','l',40, "a2", 50);
    
     
    fline(52,52,0.35,32,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 3   
    
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(20,20,0.35,25,'n','r',30, "a4", 40);
        fline(40,40,0.35,15,'c','p',50, "a2", 10);
        goto can_4;
      } 
      
    fline(20,20,0.15,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,25,'c','l',50, "a2", 30);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    check_can();
    check_can_to_floor();
   //----------------------------------------->> จบกระป๋องที่ 3 
 
    fline(60,60,0.35,0,'f','p',50, "a2", 0);   
    fline(60,60,0.35,15,'c','r',50, "a5", 30);
    can_4: //------------------------------------------>>>
    
    fline(52,52,0.35,30,'n','s',50, "a2", 10);   //------>> เดินเข้ากล่องที่ 4   
    if(analogRead(28)<ch_dis_can)
      { 
        delay(200);        
        bline(40,40,0.35,30,'c','l',30, "a3", 40);
        goto can_5;
      }  
    fline(20,20,0.15,10,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,25,'c','r',50, "a5", 30);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);

    check_can();
    check_can_to_floor();
   ///----------------------------------------->> จบกระป๋องที่ 4

    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    can_5: //------------------------------------------>>>
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_left(300, -40, 40, 86, 30);
    
    fline(52,52,0.35,31,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 5   
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);
        fline(0,0,0.0, 0,'n','r',30, "a4", 40);delay(100);        
        fline_2sensor(35, 35, 0.35, 63, "3:4","27", 's', 10);delay(50);
        goto can_6;
      } 
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,20,'f','s',50, "a2", 1);
    bw_x_left(350, -40, 40, 90, 40);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);

    check_can();
    check_can_to_floor();
   //----------------------------------------->> จบกระป๋องที่ 5 

    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_right(300, 40, -40, 85, 30);
    
    fline(52,52,0.35,29,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 6   
    can_6 : //----------------->>  
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(60,60,0.35,20,'f','s',50, "a2", 1);
        bw_x_left(350, -40, 40, 90, 40);
        goto can_7;
      }
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,20,'f','s',50, "a2", 1);
    bw_x_right(350, 40, -40, 90, 40);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);

    check_can();
    check_can_to_floor(); 
   ///----------------------------------------->> จบกระป๋องที่ 6
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    can_7 : //----------------->> 
    fline(60,60,0.35,15,'c','l',50, "a2", 30);
    
    fline(52,52,0.35,29,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 7   
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(20,20,0.35,25,'n','r',30, "a4", 40);
        fline(40,40,0.35,15,'c','p',50, "a2", 2);
        goto can_8;
      } 
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,25,'c','l',50, "a2", 30);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    
    check_can();
    check_can_to_floor();
   //----------------------------------------->> จบกระป๋องที่ 7 

    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,15,'c','r',50, "a5", 30);
    can_8 : //----------------->> 
    fline(52,52,0.35,29,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 8   
    if(analogRead(28)<ch_dis_can)
      {         
        delay(200);
        bline(40,40,0.35,30,'c','l',30, "a3", 40);
        goto can_9;
      } 
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,25,'c','r',50, "a5", 30);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    
    check_can();
    check_can_to_floor();
    
   ///----------------------------------------->> จบกระป๋องที่ 8

    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
     can_9: //------------------------------------------>>>
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_left(300, -40, 40, 86, 30);
    
    fline(52,52,0.35,29,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 9    
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);
        fline(0,0,0.0, 0,'n','r',30, "a4", 40);delay(100);        
        fline_2sensor(45, 45, 0.35, 63, "3:4","27", 's', 1);
        goto can_10;
      } 
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,30,'f','s',50, "a2", 1);
    bw_x_left(350, -40, 40, 90, 40);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    
    check_can();
    check_can_to_floor(); 
    
   //----------------------------------------->> จบกระป๋องที่ 9 
   
 
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_right(300, 40, -40, 85, 30);
    
    fline(52,52,0.35,29,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 10   
    can_10: //------------------------------------------>>>
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(60,60,0.35,20,'f','s',50, "a2", 1);
        bw_x_left(350, -40, 40, 148, 40);
        fline(52,52,0.35,35,'n','s',50, "a2", 10);
        goto can_11;
      }
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,30,'f','s',50, "a2", 1);
    bw_x_right(350, 40, -40, 90, 40);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
  
     check_can();
    check_can_to_floor(); 
   
   ///----------------------------------------->> จบกระป๋องที่ 10

    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_left(350, -40, 40, 45, 30);
    fline(52,52,0.35,40,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 11 
    can_11: //------------------------------------------>>>
      
    if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(60,60,0.35,20,'f','s',50, "a2", 1);
        bw_x_right(350, 30, -30, 120, 40);
        fline(52,52,0.35,40,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 11 
        goto can_12;
      }
     
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,40,'f','s',50, "a2", 1);
    bw_x_left(320, -40, 40, 120, 30);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    

     check_can();
    check_can_to_floor(); 
   //----------------------------------------->> จบกระป๋องที่ 11
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,15,'f','s',50, "a2", 1);
    fw_x_right(350, 40, -40, 50, 30);
    
    fline(52,52,0.35,40,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 12  
    can_12: //------------------------------------------>>>  
     if(analogRead(28)<ch_dis_can)
      {
        delay(200);  
        bline(60,60,0.35,20,'f','s',50, "a2", 1);
        bw_x_left(350, -30, 30, 45, 30);
        goto can_13;
      }
    fline(20,20,0.35,11,'n','s',50, "a2", 10);delay(200);    
    arm_close_up();
    
    bline(60,60,0.35,40,'f','s',50, "a2", 5);
    bw_x_right(320, 40, -40, 120, 30);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    
    check_can();
    check_can_to_floor(); 
   ///----------------------------------------->> จบกระป๋องที่ 12

    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','s',50, "a2", 1);
    can_13:  //-------------------------------------->>>>
    
    fline(20,20,0.35,27,'n','s',50, "a2", 10);  //------>> เดินเข้ากล่องที่ 13
    if(analogRead(28)<ch_dis_can)
      {
        none_13 = 1;
        delay(200);
        goto end_13;
      }
    arm_close_up();  
    end_13:  
    fline(15,15,0.15,10,'n','l',30, "a3", 40);
    
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    fline(60,60,0.35,0,'f','p',50, "a2", 0);
    fline(60,60,0.35,0,'c','p',50, "a2", 0);
    end_13s = 1;
    

    check_can();
    check_can_to_floor(); 
   ///----------------------------------------->> จบกระป๋องที่ 13
   
  }
